/******/ (function() { // webpackBootstrap
/******/ 	"use strict";
var __webpack_exports__ = {};
console.log(`
Оцениваю работу на 100 баллов:

Требования к вёрстке
1. Вёрстка валидная +10
2. Вёрстка семантическая +16
- В коде страницы присутствуют следующие элементы (указано минимальное количество, может быть БОЛЬШЕ):
<header>, <main>, <footer> +2.
- шесть элементов <section> (по количеству секций) +2.
- только один заголовок <h1> +2. Если элементов <h1> на странице больше одного, считаем это ошибкой.
- пять заголовков <h2> (легко отличимы на верхних границах секций, имеют единый стиль) +2.
- один элемент <nav> (панель навигации в хедере) +2.
- два списка ul > li > a (панель навигации, ссылки на соцсети в футере) +2.
- семь кнопок <button> +2.
- два инпута <input> +2.
3. Вёрстка соответствует макету +54
- блок <header> +8:
- секция Welcome +4.
- секция About +6:
- секция Favorites +8:
- секция CoffeShop +6.
- секция Contacts +6:
- секция LibraryCard +8:
- блок <footer> +8:
4. Общие требования к верстке +20
- для построения сетки используются флексы или гриды (display: flex... или display: grid...) +2.
- иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2.
- изображения добавлены в формате .jpg (.jpeg) или .png +2.
- есть favicon +2.
- плавная прокрутка по якорям +2.
- в футере название ссылки Username заменено и ведет на GitHub студента +2.
- в футере ссылка The Rolling Scopes School ведет на страницу курса https://rs.school/js-stage0/ +2.
- интерактивность элементов согласно макету. Интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +2.
- обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы +2.
`);
/******/ })()
;